Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: IRC Discussions http://meego.com/community/irc-channel
ja: IRC ディスカッション http://meego.com/community/irc-channel

source: IT Information Technology
ja: IT Information Technology (情報技術)

source: Compliance teams consist of various individuals tasked with the mission of ensuring FOSS compliance.
ja: コンプライアンス チームは、FOSS コンプライアンスを徹底する任務を負う人々で構成されています。

source: Close Inquiry
ja: 照会のクローズ

source: It is essential that engineers fill out the OSRB usage form for every FOSS project they intend to use in any product.
ja: 技術者は、製品で使用する FOSS プロジェクトごとに OSRB 使用申請書を記入する必要があります。

source: For the acquiring company, comprehensive code evaluation assures accurate valuation of software assets and mitigates the risk of unanticipated licensing issues undermining future value.
ja: 買収側企業は、包括的なコード評価を行うことにより、ソフトウェア資産を正確に査定することができ、将来的な価値低下につながる不測のライセンス リスクを低減することができます。

source: For instance, satisfaction of supporting practices may be used to assess whether the goals of core compliance processes (Discovery, Review and Approval, Obligation Satisfaction, and Community Contributions) have been satisfied (in the mode of the Software Engineering Institute's Capability Maturity Model).
ja: たとえば、サポート事例の満足度は、コアのコンプライアンス プロセス (検出、レビューと承認、義務履行、およびコミュニティの貢献) の目的が果たされているかどうかを、Software Engineering Institute の 能力成熟度モデル (Capability Maturity Model: CMM) を用いて評価する際に使用できます。◆◆

source: MeeGo utilizes two OBS: the MeeGo Build Service used for building the MeeGo OS itself and the MeeGo Community Build Service used by application developers to build applications for MeeGo.
ja: MeeGo は 2 つの OBS を利用します。MeeGo OS 自体をビルドするために使用する MeeGo Build Service と、アプリケーション開発者が MeeGo 向けアプリケーションをビルドするために使用する MeeGo Community Build Service です。

source: It also recommends proper post-violation responses to the concerns of copyright holders.
ja: また、著作権を侵害してしまった場合には、著作権所有者の懸念に対して適切な対応を行うよう勧めています。

source: Overview of the compliance program
ja: コンプライアンス プログラムの概要

source: The UEFI secure boot facility is designed to be readily usable by both proprietary and open operating systems to improve the security of the bootstrap process.
ja: UEFI secure boot 機能は、ブートストラップ処理のセキュリティを高めるために、プロプライエタリな OS にもオープン OS にも簡単に利用できるよう設計されています。

source: It also outlines business practices and methods that lead to better GPL compliance.
ja: また、よりよい GPL コンプライアンスを実現するためのビジネス プラクティスやメソッドについても概説しています。

source: a) A defined format for the disclosure is used.
ja: a) 開示用に定義されている書式を使用する。

source: a)The organization makes available a repository of license texts and obligation requirements to assure consistent interpretation and compliance activities.
ja: a) 組織は、ライセンス文書と義務要件のリポジトリを利用可能にし、一貫した解釈とコンプライアンス作業ができるようにすること。

source: The guide is available from http://softwarefreedom.org.
ja: このガイドは、http://softwarefreedom.org.からダウンロードできます。

source: Ever since companies started integrating FOSS in their products, there has been the need to ensure compliance with applicable FOSS licenses.
ja: 企業が製品に FOSS を組み込むようになり、適用される FOSS ライセンスを確実に順守することが重要な課題となっています。

source: As part of this step of compliance due diligence, there are two important reviews: architecture review and linkage analysis review.
ja: コンプライアンス精査ステップには、2 つの重要な調査作業が含まれています。それは、アーキテクチャ レビューとリンク解析レビューです。

source: This one is particularly embarrassing.
ja: これは非常に面倒である。

source: The image step combines these items and sets them up in a file system image that can be directly used by the target system for booting.
ja: イメージ ステップでは、これらのアイテムを組み合わせて、ターゲット システムで直接ブートして使用できるような、ファイル システム イメージにします。

source: Failure to provide the modifications applied to the original FOSS:
ja: オリジナルの FOSS に適用した変更を配布していない:

source: License Compatibility
ja: ライセンスの両立性

source: Copyrights and Dates
ja: 著作権情報と日付

source: There is a limited number of licenses
ja: 限られた数のライセンスのみが存在する

source: Additional training on OSS-related topics is provided to augment the basic curriculum for both managers and non-managers.
ja: 基本カリキュラムを補足するために、マネージャーおよびマネージャー以外の社員の両方に、OSS に関する追加ののトレーニングを提供すること。

source: Limitations of FOSSology
ja: FOSSology の制約

source: The Linux Foundation promotes, protects and standardizes Linux by hosting important workgroups, events and online resources such as Linux.com.
ja: The Linux Foundation は、重要な各種のワークグループ、イベント、Linux.com などのオンライン リソースを運営し、Linux の普及促進、保護、ならびに標準化に取り組んでいます。

source: The organization assesses its compliance process to identify and prioritize opportunities for automation and tool support.
ja: 組織は、コンプライアンス プロセスを評定し、自動化とツール サポートの機会を見極め、優先順位付けしている。

source: The ability of the platform owner to regain control should they desire it is guaranteed by the ability to securely reset the platform back to setup mode.
ja: プラットフォーム オーナーは、プラットフォームを安全に setup モードにリセットできることが保証されているため、彼らが望めば、いつでも制御権を取り戻すことができます。

source: Verifying that all sub-tasks related to the compliance ticket have been completed and closed before approving the compliance ticket.
ja: コンプライアンス チケットを承認する前に、そのコンプライアンス チケットに関するすべてのサブタスクが完了し、クローズされていることを確認します。

source: If there is a compliance issue, you will call for an OSRB meeting to discuss the case, learn how this non-compliance occurred, and improve existing process and practices to ensure that such errors do not happen again.
ja: コンプライアンス問題が存在する場合は、その訴訟を議論するための会議を OSRB (オープンソース調査委員会) に要請し、なぜこのコンプライアンス違反が発生したかを学び、このような過ちが二度と起こらないように従来の処理および慣行を改善します。

source: To remedy this situation, the Linux Foundation has created a directory of open source compliance officers at companies using Linux and open source software in their commercial products.
ja: LF では、このような状況の解決策として、商品に Linux/OSS を使用している企業のオープン コンプライアンス オフィサーのディレクトリ (名簿) を作成しました。

source: The metadata database stores information about projects, packages, users, user groups, access control and so forth.
ja: メタデータ データベースは、プロジェクト、パッケージ、ユーザー、ユーザー グループ、アクセス制御などに関する情報を保持しています。

source: A software inventory tool to keep track of every single software component, version, products that uses it, linkage method, and other important information
ja: 各ソフトウェア コンポーネント、バージョン、それを使用している製品、リンク方法、およびその他の重要な情報を記録するためのソフトウェア インベントリ ツール

source: Facts that deal with a software package’s identification (metadata) included in the SPDX(TM) specification are:
ja: SPDX™ の仕様書では、ソフトウェア パッケージの識別情報 (メタデータ) に対応するものとして、次のようなものを挙げています。

source: Pitfalls and common process challenges in establishing compliance programs will also be discussed.
ja: コンプライアンス プログラムを確立する際の落とし穴や共通プロセス課題についても取り上げます。

source: Figure 2 presents a sample process that illustrates the steps a compliance inquiry should go through from the time a company receives the inquiry until the inquiry is resolved.
ja: 図 2 のサンプル プロセスは、コンプライアンスの照会を受けてから解決するまでの手順を表したものです。

source: In this case, a record is created when the FOSS component is discovered.
ja: そのような場合は、FOSS コンポーネントが検出された時点でコンプライアンス記録が作成される。

source: Tools to assist in compliance verification and assurance
ja: コンプライアンスの検証と保証を支援するツール

source: Some companies prefer not to include the name of their employees in change log files.
ja: 変更記録ファイルに社員名を入れることを好まない企業もあります。

source: Finally, facts that are specific to a software package’s file-specific properties included in the SPDX(TM) spec cover standardized fields, e.g.:
ja: 最後に、SPDX™ の仕様書では、ソフトウェア パッケージのファイル別プロパティに関する情報として、次のようなものを挙げています。

source: Source
ja: ソース

source: Compliance Officer
ja: コンプライアンス オフィサー

source: Information Technology
ja: 情報システム

source: Identification of FOSS step as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「FOSS の識別」のステップ

source: Settlement costs with the plaintiffs
ja: 原告との和解費用

source: Lessons Learned From Compliance Disputes
ja: コンプライアンスに関する紛争から学んだ教訓

source: This scheme of allowing the platform owner to boot arbitrarily-modified operating systems via KEKs that they construct is fully compliant with all OSI-approved open-source licences.
ja: プラットフォーム オーナーが、任意に修正された OS を自身で作成した鍵交換鍵でブートできるようにすることは、OSI (Open Source Initiative) が承認したどのオープンソース ライセンスにも違反しません。

source: Answers to these questions form the starting point for a license compliance and IP review.
ja: このような活動が、ライセンス コンプライアンスと IP レビューの出発点になります。

source: Loading Files into FOSSology
ja: FOSSology へのファイルの読み込み

source: Test Integration ?
ja: テストの統合

source: Take FOSS Training
ja: FOSS トレーニングを実施する

source: A defined code distribution mechanism is used to respond to routine requests for source code distribution.
ja: ソースコード配布リクエストに対応するために、定義されたコード配布メカニズムを用意すること。

source: This paper is one in a series that discusses the topic of FOSS compliance and it is part of the free educational material that the Linux Foundation is making available under the Open Compliance Program.
ja: このホワイトペーパーは、FOSS (フリー&オープン ソース ソフトウェア) コンプライアンスのトピックを取り上げたシリーズの 1 つで、The Linux Foundation がオープン コンプライアンス プログラムのもとで公開している無償の教育資料です。

source: Resources
ja: リソース

source: Training will be offered live on-site or online in half-day, one day, or two-day formats.
ja: トレーニングの受講はオンサイトでもオンラインでも可能で、半日、1 日、または 2 日間コースがあります。

source: c)The organization tracks progress of the review and approval process for OSS cases.
ja: c) 組織は、OSS 使用事例の調査と承認プロセスの進捗を追跡する。

source: --- END OF CHECKLIST ---
ja: --- チェックリスト終了 ---

source: MeeGo Forums http://meego.com/community/forum
ja: MeeGo フォーラム http://meego.com/community/forum

source: Its sole purpose is to bring process gaps to light which will, if unaddressed, inevitably lead to compliance problems.
ja: このチェックリストの目的は、解決しなければコンプライアンス問題に発展するようなプロセスの欠落を明確にすることです。

source: Progress is tracked against the organization's and product team's compliance plans and additional resources are added as needed to achieve compliance objectives.
ja: 組織のコンプライアンス計画と、製品担当チームのコンプライアンス計画に対して、進行状況を追跡する。また、コンプライアンスの目的を達成するために、必要に応じて人材を追加する。

source: Communication is essential to ensure the success of the compliance activities.
ja: コミュニケーションは、コンプライアンス活動の成功を保証するために不可欠です。

source: In the case of FOSS compliance, due diligence is required to ensure the following:
ja: FOSS コンプライアンスについては、以下の事実を確認するための精査が必要です。

source: - A compliance record is created (or updated) for the FOSS
ja: その FOSS のコンプライアンス記録が作成 (または更新) される

source: The FOSSology Project is a FOSS project built around an open and modular architecture for analyzing software.
ja: FOSSology プロジェクトは、オープンでモジュール化されたソフトウェア解析アーキテクチャを持つ FOSS プロジェクトです。

source: The identification of FOSS (Figure 2) is the first and initial step in the compliance due diligence process.
ja: FOSS の識別 (図 2) は、コンプライアンス精査プロセスの第一ステップです。

source: - A discovery of FOSS being used as part of third party software
ja: サード パーティ ソフトウェアに組み込まれている FOSS が検出される

source: James Bottomley, CTO, Server Virtualization at Parallels & Linux Foundation Technical Advisory Board Chair
ja: James Bottomley (Parallels 社サーバー仮想化担当 CTO 兼 Linux Foundation テクニカル アドバイザリ ボード チェア)

source: Availability
ja: 開催日程ほか

source: You should rely on your build tools to be able to identify code changes, who made them and when.
ja: ビルドツールなどを利用して、コードの改変を識別し、誰が、いつ改変したかを特定してください。

source: Open Source Review Board
ja: オープン ソース レビュー ボード

source: Founded in 2007, the Linux Foundation sponsors the work of Linux creator Linus Torvalds and is supported by leading Linux and open source companies and developers from around the world.
ja: 2007年に設立された The Linux Foundation は、Linux 開発者である Linus Torvalds の活動を支援し、世界中の Linux ならびにオープンソース関連の企業や開発者に支援されています。

source: Inform the reporter that you are investigating and will report back on your findings within x number of days
ja: 照会者に対して、「実態を調査し、その結果を x 日以内に回答する」旨を伝える。

source: Projects can depend on each other, so-called Subprojects, or Packages can depend on Packages contained in other Projects.
ja: プロジェクトが、いわゆるサブプロジェクトとして互いに依存したり、パッケージが、他のパッケージに含まれるパッケージに依存したりすることがあります。

source: The organization maintains complete and accurate records about the OSS content in its products, and the context in which it is used, according to a defined procedure.
ja: 組織は、定義されている手順に従って、自社製品内の OSS コンテンツ、およびそれが使用されている状況について、完全かつ正確な記録を保持する。

source: While there are other solutions available, OBS is an excellent solution for organizations developing software for Linux.
ja: ほかにも利用できるソリューションはありますが、Linux 向けのソフトウェア開発を行っている組織にとっては、OBS が最適なソリューションです。

source: Do the right thing
ja: 正しい行動をとる

source: On the other hand, a worker deployed on an x86-based system can build packages for x86 but may also be able to build packages for ARM if a cross-toolchain or emulation is available.
ja: 一方、x86 ベースのシステムにデプロイされたシステムは、x86 用のパッケージをビルドでき、さらに、クロスツールチェーンやエミュレーションが利用可能であれば、ARM 用のパッケージもビルドできます。

source: - All appropriate notices have been included in the product documentation to inform end-users of their right to request source code for identified FOSS
ja: すべての適切な告知が製品の付随資料に含まれ、製品内の FOSS のソース コードの要求権についてエンド ユーザーに通知されていること。

source: Design guidance for engineers
ja: 技術者のための設計ガイダンス

source: The Open Compliance Program welcomes contributions – favored compliance practices, tools, procedures, forms, strategies, and organizing principles – and is eager to identify organizations to provide feedback on a beta version of the checklist.
ja: オープン コンプライアンス プログラムでは、コンプライアンスの成功事例、ツール、手続き、フォーム、戦略、組織化原理などを募集しています。また、ベータ バージョンのチェックリストに関するご意見も受け付けていますので、ぜひご協力ください。

source: 3rd Party Commercial + FOSS
ja: サード パーティ商用 + FOSS

source: Today, FOSSology is used by open source license compliance teams, distributions, legal offices, and many others.
ja: 今日、FOSSology は、オープン ソース ライセンス コンプライアンス チーム、ディストリビューション、リーガル オフィスをはじめ、多くの組織で使用されています。

source: The Home Project is a sandbox for the developers in which they can build their own Packages against other Projects in the OBS repositories without the risk of affecting those Projects.
ja: ホーム プロジェクトは、開発者のためのサンドボックスであり、開発者は OBS リポジトリ内の他のプロジェクトに影響を与えることなく、各自のパッケージをビルドできます。◆

source: Existing business processes are modified to incorporate OSS compliance activities and considerations.
ja: 既存のビジネス プロセスを修正し、OSS コンプライアンス作業と検討事項を組み込むこと。

source: Future plans, documentation, virtually everything about the project can be discovered on http://fossology.org.
ja: 今後の予定、資料、およびプロジェクトに関する詳細については、http://fossology.org を参照してください。

source: Confirm that you treat compliance inquiries seriously and consider achieving compliance as part of the development process
ja: コンプライアンスの照会を深刻に受け止め、コンプライアンスの遂行を開発プロセスの一環と考えていることを明言する

source: We provide more information about this checklist and its availability at the end of this paper.
ja: このチェックリストの入手方法については、巻末を参照してください。

source: Supporting
ja: サポート

source: Risks are mitigated through license negotiation
ja: リスクはライセンス交渉によって低減される

source: Figure 7 shows a very simple bucket view of the same files as the license view in Figure 3.
ja: 図 7 は、図 3 のライセンス表示と同じファイルをシンプルにバケット表示したものです。

source: When the source code is scanned and compliance issues are flagged or discovered, there are a number of ways to resolve issues.
ja: ソース コードがスキャンされ、コンプライアンス問題が警告または発見された場合、さまざまな解決方法が考えられます。

source: Recognition of:
ja: 認識情報:

source: 2) FOSSology FOSSology is a source code scanning tool which provides a framework for software analysis that allows you to discover licenses, parse RPM spec files, determines file types, and unpacks input files (such as .tar, .gz and .iso) into their component files.
ja: 2) FOSSology。このツールは、ソフトウェアを解析するためのフレームワークを提供するソース コード スキャン ツールです。ライセンスの検出、RPM spec ファイルの解析、ファイル タイプの識別、.tar、.gz、.iso などの入力ファイルからコンポーネント ファイルへの解凍などが可能です。

source: The Open Compliance Program
ja: オープン コンプライアンス プログラム

source: The organization responds to all external compliance requests in a timely manner.
ja: 組織は、外部からのあらゆるコンプライアンス リクエストにタイムリーに応答する。

source: It is also advisable to send updates of your internal investigation when they are available.
ja: また、可能であれば、社内における調査の最新情報を伝えることをお勧めします。

source: Facilitate effective usage of FOSS in commercial products
ja: 商品における FOSS の効果的な利用を促進する

source: Then we demonstrate the use of the OBS WebUI and the command-line client osc with step-by-step instructions.
ja: 続いて、OBS WebUI の使い方、および osc コマンドライン クライアントについて、詳しく説明します。◆

source: The organization tracks progress of compliance activities for a product being readied for release.
ja: 組織は、リリース準備中の製品について、コンプライアンス作業の進捗を追跡する。

source: - Update the release’s bill of materials to account for any FOSS added in releases since the last previous scan
ja: そのリリースの BoM (Bill of Material) を更新し、最後のスキャン処理後のリリースで追加されたすべての FOSS を反映させる

source: The external portal offers a platform for the company towards the world, the FOSS community, and a venue to post all the source code of FOSS packages they use, in fulfillment of their license obligations.
ja: 外部ポータルは、企業と外部世界や FOSS コミュニティとの情報交換の機会を提供し、ライセンス義務に従い、彼らが使用する FOSS パッケージのすべてのソース コードを掲示する場所でもあります。

source: - Registering FOSS in the software inventory
ja: ソフトウェア インベントリに FOSS を登録する

source: The guide focuses on avoiding compliance actions and minimizing the negative impact when enforcement actions occur.
ja: そのガイドでは、コンプライアンス訴訟を回避すること、および法執行活動が発生した場合の悪影響を最小限に抑えることに重点を置いています。

source: Third party software, developed by third party software providers or consultants and made available under a commercial or FOSS license.
ja: 2 つ目はサード パーティ商用ソフトウェアです。サード パーティのソフトウェア提供者やコンサルタントによって開発され、商用ライセンスや FOSS ライセンスのもとで入手されたものです。

source: The organization maintains an awareness of community initiatives to address supply chain issues with respect to OSS compliance.
ja: 組織は、OSS コンプライアンスに関わるサプライ チェーンの問題に対応するために、常にコミュニティの動きに着目していること。

source: The MeeGo OBS regularly builds two releases per week with images for all reference hardware platforms and architectures (Figure 1).
ja: MeeGo OBS は、すべてのリファレンス ハードウェア プラットフォームとアーキテクチャに対応するイメージで、毎週 2 つのリリースを定期的にビルドしています。

source: Company to notify previous recipients of the product that the product contains GPL code and inform them of their rights to receive a copy of the source code
ja: 企業は、製品の過去の受領者に対し、製品がGPL コードを含むことを通知し、そのソース コードの複写を入手する権利があることを教える

source: The recommendations can be summarized as follows:
ja: 推奨事項をまとめると、以下のようになります。

source: However, a major deviation - even a single one - could be fatal to certification.)
ja: しかし、大きな逸脱は、たとえ 1 つでも、認定を阻む可能性があります。）◆◆

source: The Legal representative is a member of the OSRB and provides legal advice and guidance to engineering teams on FOSS legal questions and issues.
ja: 法律顧問は OSRB のメンバーで、エンジニアリング チームに対し、FOSS の法務的な質問や問題点に関する助言や説明を行います。

source: This document is intended to describe how the UEFI secure boot specification can be implemented to interoperate well with open systems and to avoid adversely affecting the rights of the owners of those systems while providing compliance with proprietary software vendors’ requirements.
ja: このホワイトペーパーでは、オープン システムにおいて、システムのオーナーの権利に悪影響を与えず、しかもプロプライエタリ ソフトウェア ベンダーの要件を満たしながら、UEFI secure boot の仕様を実装する方法について説明します。

source: The goal with this activity is to determine whether any bug fixes or security patches have become available and take responsibility for updating the FOSS component used in the product.
ja: この作業の目的は、利用可能なバグフィックスやセキュリティ パッチがあるかどうか確認し、製品で使用されている FOSS コンポーネントを更新することです。

source: or
ja: または

source: - Mandate third party software providers to disclose FOSS in what is being delivered
ja: サードパーティのソフトウェア提供者に、配布されている製品内の FOSS を開示するよう求める

source: Depending on the size of the company, the auditing responsibilities can be assigned to the OSRB or to an auditing team that reports to the compliance officer.
ja: 企業の規模により、監査責任を OSRB が負う場合もあれば、コンプライアンス オフィサーに所属する監査チームが負う場合もあります。

source: Open Compliance White Papers
ja: オープン コンプライアンス ホワイト ペーパー

source: Rudolf Streif manages The Linux Foundation's initiatives for embedded solutions working with the community to provide environments and platforms for embedded Linux systems.
ja: Rudolf Streif は、The Linux Foundation の組込みソリューション活動をマネジメントしており、コミュニティと連携して、組込み Linux システムの環境やプラットフォームを提供しています。

source: In fact, in nearly every GPL enforcement case that I've worked on in my career, the fact that infringement had occurred was never in dispute.
ja: 実際、私が関わった GPL 係争では、違反が発生したという事実が争点になったものはほとんどありません。

source: Conventional Analysis
ja: 通常解析 (conventional analysis)

source: - Employees are educated on some of the most common FOSS licenses and the issues surrounding using FOSS in commercial products.
ja: - 従業員が、一般的な FOSS ライセンスについて、および商品に FOSS を使用する際の諸問題について理解していること。

source: All of the disputes reached a settlement agreement that included one or more of the below mentioned terms:
ja: すべての紛争は、次の 1 つ以上の条件を含む和解合意で終結します。

source: Some licenses require offers of source code for the covered open source and for modifications made to the code.
ja: 含まれているオープン ソースやそのコードの改変内容について、ソース コードを提供するよう求めるライセンスもあります。

source: The tool enables companies to produce more accurate reports on open source components in product updates by identifying changes in source code components included.
ja: このツールを使用することにより、製品に含まれているソース コード コンポーネントの違いを識別できるため、更新された製品内のオープン ソース コンポーネントについて、より正確なレポートを作成することができます。

source: Repeatable ?
ja: 反復可能であること

source: File Name (including subdirectory)
ja: ファイル名 (サブディレクトリも)

source: This document is intended for use by teams responsible for defining, implementing, and improving open source compliance programs within their organizations.
ja: このチェックリストは、組織においてオープン ソース コンプライアンス プログラムの定義、実装、および改善を担当するチームが使用するように開発されました。

source: Step-by-step Instructions to your own OBS Instance, Jan-Simon Moeller and Rudolf Streif, The Linux Foundation
ja: 自分専用の OBS インスタンスについての段階的説明。Jan-Simon Moeller and Rudolf Streif, The Linux Foundation

source: It is important to understand the reporter, their motivation and to verify if their accusation is accurate or even current.
ja: 照会者とその動機を理解し、彼らの訴えが正しいか、現時点で意味のあるものかを確認することが重要です。

source: Legal Programs
ja: リーガル プログラム

source: Because of the license orientation of the specification, the Working Group is committed to providing standardized license references.
ja: 同ワーキング グループは、仕様書のライセンス指向性を高めるために、標準化されたライセンス リファレンスの提供に取り組んでいます。

source: The organization then faces the task of adopting and implementing a build system.
ja: そして組織は、やがて、ビルド システムの導入/実装という作業に直面することになります。

source: b) The organization audits and inventories the OSS included in its products for distribution.
ja: b) 組織は、出荷する製品に含まれる OSS の監査と目録作成を行う。

source: The Compliance Directory will be available starting August 10, 2010, and companies can add their contact information for compliance purposes at http://www.linuxfoundation.org/services/compliance/directory.
ja: コンプライアンス ディレクトリは 2010 年 8 月 10 日から提供される予定です。コンプライアンスを目的とする連絡先情報は、下記のページで追加してください。 http://www.linuxfoundation.jp/programs/legal/compliance/directory

source: Conceptually, OBS is composed of a frontend and a backend.
ja: 概念的には、OBS はフロントエンドとバックエンドで構成されています。

source: Protect commercial product differentiation
ja: 商品の差別化を維持する

source: Once all pre-distribution verifications have been completed, the next step is to upload the FOSS packages to the distribution web site, identified with labels as to which product and version it corresponds to (Figure 12).
ja: 配布前の検証がすべて完了したら、対応している製品とバージョンがわかるようにラベル付けして、FOSS パッケージを配布用 Web サイトにアップロードします (図 12)。

source: Measurement and analysis (measures and metrics used to monitor process execution)
ja: 測定と分析 (プロセスの実行を監視するために使用する手段と基準)

source: As a reminder, companies should not ignore compliance inquiries.
ja: 繰り返しますが、企業はコンプライアンスの照会を無視してはいけません。

source: d)OSS training is provided as part of new hire orientation.
ja: d) OSS トレーニングを新入社員のオリエンテーションに組み込んで提供すること。

source: Do you remember the feeling when you first looked inside a computer?
ja: コンピューターの中を初めて覗いた時のことを覚えていますか？

source: As frequently the case with any other decision, the approaches range from building your own solution to integrating a readily available system, either commercially or open-source.
ja: その際、独自のソリューションを構築するケースもあれば、手軽に利用できる (商用またはオープンソースの) システムを統合するケースもあります。

source: In this step of the compliance due diligence, all issues identified during the auditing step are resolved (Figure 5).The OSRB Chair will monitor closure of tickets assigned to engineers during the Audit step.
ja: コンプライアンス精査の中のこのステップでは、監査ステップで検出されたすべての問題を解決します (図 5)。OSRB チェアは監査ステップでエンジニアに割り当てられたチケットのクローズを監視します。
